{
  "history": [
    {
      "title": "Origines et Développement",
      "content": "Antiquité : Les premières formes de combat en Corée, comme le taekkyeon et le subak, se concentraient principalement sur les coups de pied, et ces traditions ont influencé le développement du taekwondo.\n\nPériode japonaise (1910-1945) : Pendant l'occupation japonaise, les arts martiaux coréens ont été interdits, mais certains maîtres ont continué à pratiquer en secret ou ont appris des arts martiaux japonais comme le karaté, qui ont influencé la création du taekwondo.\n\nAprès 1945 : Après la Seconde Guerre mondiale, avec la libération de la Corée, plusieurs maîtres d'arts martiaux coréens ont commencé à enseigner différentes formes d'arts martiaux qui ont finalement été unifiées sous le nom de \"taekwondo\" en 1955 par le général Choi Hong Hi, souvent considéré comme le père fondateur du taekwondo moderne."
    },
    {
      "title": "Évolution Moderne",
      "content": "1959 : La formation de la Korea Taekwondo Association (KTA) a marqué le début de l'organisation structurée du taekwondo.\n\n1966 : La création de l'International Taekwon-Do Federation (ITF) par le général Choi a permis de promouvoir le taekwondo au niveau international.\n\n1973 : Le taekwondo a connu une scission avec la fondation de la World Taekwondo Federation (WTF), maintenant connue sous le nom de World Taekwondo (WT), qui se concentre davantage sur le sport et la compétition.\n\n1988 : Le taekwondo a été introduit comme sport de démonstration aux Jeux olympiques de Séoul.\n\n2000 : Le taekwondo est devenu un sport olympique officiel aux Jeux de Sydney."
    },
    {
      "title": "Caractéristiques",
      "content": "Le taekwondo se distingue par son accent sur les techniques de coups de pied rapides et puissants, les coups de poing, les blocs, ainsi que les déplacements rapides. Il met également l'accent sur la discipline mentale, la maîtrise de soi, et le respect des autres."
    },
    {
      "title": "Taekwondo Aujourd'hui",
      "content": "Aujourd'hui, le taekwondo est pratiqué par des millions de personnes dans le monde entier. Il est à la fois un art martial, un sport de compétition, et un moyen de développement personnel. Il existe deux principales organisations : la WT, qui régit le taekwondo en tant que sport olympique, et l'ITF, qui conserve un style plus traditionnel.\n\nLe taekwondo continue d'évoluer, tout en restant fidèle à ses racines, et il joue un rôle important dans la culture sportive mondiale."
    }
  ]
}
